# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [5]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [36]:
df_earnings = pd.read_csv("employee_promotion.csv")

In [37]:
df_earnings.tail()

,employee_id,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,awards_won,avg_training_score,is_promoted
54803,3030,Technology,region_14,Bachelor's,m,sourcing,1,48,3.0,17,0,78.0,0
54804,74592,Operations,region_27,Master's & above,f,other,1,37,2.0,6,0,56.0,0
54805,13918,Analytics,region_1,Bachelor's,m,other,1,27,5.0,3,0,79.0,0
54806,13614,Sales & Marketing,region_9,NaN,m,sourcing,1,29,1.0,2,0,NaN,0
54807,51526,HR,region_22,Bachelor's,m,other,1,27,1.0,5,0,49.0,0

In [24]:
df_earnings['department'].value_counts()

Sales & Marketing    16840
Operations           11348
Technology            7138
Procurement           7138
Analytics             5352
Finance               2536
HR                    2418
Legal                 1039
R&D                    999
Name: department, dtype: int64

### Info on Unique Values

In [2]:
df['col2'].unique()

array([444, 555, 666])

In [3]:
df['col2'].nunique()

3

In [4]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Selecting Data

In [25]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [26]:
newdf

   col1  col2 col3
3     4   444  xyz

### Applying Functions

In [27]:
df_earnings[df_earnings['education'] == "Bachelor's"]

,employee_id,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,awards_won,avg_training_score,is_promoted
1,65141,Operations,region_22,Bachelor's,m,other,1,30,5.0,4,0,60.0,0
2,7513,Sales & Marketing,region_19,Bachelor's,m,sourcing,1,34,3.0,7,0,50.0,0
3,2542,Sales & Marketing,region_23,Bachelor's,m,other,2,39,1.0,10,0,50.0,0
4,48945,Technology,region_26,Bachelor's,m,other,1,45,3.0,2,0,73.0,0
5,58896,Analytics,region_2,Bachelor's,m,sourcing,2,31,3.0,7,0,85.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
54801,12431,Technology,region_26,Bachelor's,f,sourcing,1,31,NaN,1,0,78.0,0
54802,6915,Sales & Marketing,region_14,Bachelor's,m,other,2,31,1.0,2,0,49.0,0
54803,3030,Technology,region_14,Bachelor's,m,sourcing,1,48,3.0,17,0,78.0,0
54805,13918,Analytics,region_1,Bachelor's,m,other,1,27,5.0,3,0,79.0,0
54807,51526,HR,region_22,Bachelor's,m,other,1,27,1.0,5,0,49.0,0

In [45]:
def times2(x):
    if x > 50:
        return x+1
    else:
        return x+5

In [46]:
df_earnings['age_new'] = df_earnings['age'].apply(times2)

In [48]:
df_earnings[[ 'age', 'age_new' ]][df_earnings['age']>48]

       age  age_new
12      49       54
33      57       58
42      59       60
45      50       55
49      56       57
...    ...      ...
54757   54       55
54767   49       54
54777   52       53
54792   59       60
54799   50       55

[3814 rows x 2 columns]

In [0]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [0]:
df['col1'].sum()

10

** Permanently Removing a Column**

In [0]:
del df['col1']

In [0]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

** Get column and index names: **

In [50]:
df_earnings.columns

Index(['employee_id', 'department', 'region', 'education', 'gender',
       'recruitment_channel', 'no_of_trainings', 'age', 'previous_year_rating',
       'length_of_service', 'awards_won', 'avg_training_score', 'is_promoted',
       'age_new'],
      dtype='object')

In [51]:
df_earnings.index

RangeIndex(start=0, stop=54808, step=1)

** Sorting and Ordering a DataFrame:**

In [0]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [52]:
df_earnings.sort_values(by='age') #inplace=False by default

,employee_id,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,awards_won,avg_training_score,is_promoted,age_new
37956,30951,Sales & Marketing,region_2,NaN,m,other,1,20,NaN,1,0,47.0,0,25
11514,29888,Sales & Marketing,region_13,Bachelor's,m,other,1,20,3.0,2,0,51.0,0,25
40106,4408,Operations,region_2,Bachelor's,m,other,1,20,1.0,2,0,63.0,0,25
53379,29392,Sales & Marketing,region_22,NaN,m,sourcing,1,20,NaN,1,0,52.0,0,25
54575,41512,Operations,region_2,Master's & above,f,sourcing,1,20,3.0,2,0,57.0,0,25
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
30911,53581,HR,region_2,Bachelor's,f,sourcing,1,60,5.0,11,0,50.0,0,61
4876,15618,Sales & Marketing,region_2,Master's & above,m,other,2,60,2.0,4,0,48.0,0,61
18963,46958,HR,region_2,Master's & above,m,sourcing,1,60,2.0,4,0,54.0,0,61
30863,50432,Operations,region_2,Master's & above,m,other,1,60,5.0,8,0,64.0,0,61
27745,35176,Procurement,region_2,Master's & above,f,other,2,60,3.0,13,0,68.0,0,61

** Find Null Values or Check for Null Values**

In [0]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [0]:
# Drop rows with NaN Values
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

** Filling in NaN values with something else: **

In [0]:
import numpy as np

In [0]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [0]:
df.fillna('FILL')

   col1  col2 col3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

In [0]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [0]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [0]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Great Job!